---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.SystemZoneData.ZoneEquipmentId
source: html/b5cbf792-2a36-2932-b554-04e7a2edcf8f.htm
---
# Autodesk.Revit.DB.Mechanical.SystemZoneData.ZoneEquipmentId Property

The id of the zone equipment related to the zone.

## Syntax (C#)
```csharp
public ElementId ZoneEquipmentId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null